//ÎÄ¼ş×¢ÊÍfi ctrl+enter
/******************************************************************************

                  °æÈ¨ËùÓĞ (C), 2001-2018, invoker

 ******************************************************************************
  ÎÄ ¼ş Ãû   : heloo world.c
  °æ ±¾ ºÅ   : ³õ¸å
  ×÷    Õß   : invoker
  Éú³ÉÈÕÆÚ   : 2018Äê12ÔÂ24ÈÕ
  ×î½üĞŞ¸Ä   :
  ¹¦ÄÜÃèÊö   : ²âÊÔ¹¦ÄÜ
  º¯ÊıÁĞ±í   :
*
*       1.                sss
*       2.                test
*
/*
  ĞŞ¸ÄÀúÊ·   :
  1.ÈÕ    ÆÚ   : 2018Äê12ÔÂ24ÈÕ
    ×÷    Õß   : invoker
    ĞŞ¸ÄÄÚÈİ   : ´´½¨ÎÄ¼ş

******************************************************************************/

/*----------------------------------------------*
 * Íâ²¿±äÁ¿ËµÃ÷                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * Íâ²¿º¯ÊıÔ­ĞÍËµÃ÷                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * ÄÚ²¿º¯ÊıÔ­ĞÍËµÃ÷                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * È«¾Ö±äÁ¿                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * Ä£¿é¼¶±äÁ¿                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * ³£Á¿¶¨Òå                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * ºê¶¨Òå                                       *
 *----------------------------------------------*/

#include "heloo word.h"

CTRL+1
*/
#if 0
CTRL+3
#endif
//CTRL+8

/*
source insightÖ»ÄÜ±à¼­²»ÄÜ±àÒë,±àÒëÔÚlinux»·¾³ÏÂÔËĞĞ
*/

/*
crtl+TÖ±½Ó·µ»Øµ±Ç°ÎÄ¼şµÄÂ·¾¶
ÔÄ¶ÁxenÔ´ÂëÊ±£¬ÓÃµ½ÁËSource Insight.Ä¬ÈÏÇé¿öÏÂ£¬ÍùÀïÌí¼ÓÖĞÎÄ×¢ÊÍÊ±£¬×Ö¼ä¾àºÜ´ó¡£½â¾ö·½·¨ÈçÏÂ£
 1¡¢Options->Style Properties 2¡¢ÔÚ×ó²àStyle NameÏÂÕÒµ½Comment Multi Line¡¢Comment¡¢Comment Right¡¢Comment Single Line£¬
·Ö±ğÑ¡ÖĞ¸öÏî£¬ÔÚÓÒ±ß¶ÔÓ¦µÄFontÊôĞÔ¿òÏÂµÄFont NameÖĞÑ¡¡°Pick...¡±£¬ÉèÖÃÎª×ÖÌåÎªFixedsys¡¢³£¹æ¡¢×ÖºÅÉèÎª12£¬È·¶¨¡£
£¨×ÖºÅ¿É¸ù¾İ×Ô¼ºµÄÏ²ºÃºÍÏÔÊ¾Æ÷´óĞ¡ÊÊµ±ÉèÖÃ£¬µ±È»£¬²»Í¬µØ·½µÄ×¢ÊÍÒ²¿ÉÒÔÉèÖÃ³É²»Í¬µÄÑùÊ½£© 3¡¢Options->Save Configuration
*/




{
//  À¨ºÅCTRL+enter×Ô¶¯²¹È«
}
/*ctrl+enter ×Ô¶¯Éú³É
while ctrl+enter ×Ô¶¯Éú³É
while ( # )
{
    #
}
for ( i = 0 ; i # ; i++ )
{
    #
}
switch ( # )
{
*/
    case # :
        ;
        break;

    case # :
        ;
        break;

    default:
        ;
        break;
}
//ctrl+cÑ¡ÖĞdefineÓï¾ä£¬È»ºóÔÚswitchºóÃæÑ¡Ôñctrl+enter£¬²ÎÊıÎª0¸ö¾Í×Ô¶¯²¹È«defineÄÚÈİ
#define a 2
 
switch  ( # )
{

    case a:
        #
        break;

    default:
        ;
        break;
}
/*****************************************************************************
 º¯ Êı Ãû  : test
 ¹¦ÄÜÃèÊö  : ²âÊÔº¯Êı¹¦ÄÜ  
 ÊäÈë²ÎÊı  : int x  
 Êä³ö²ÎÊı  : ÎŞ
 ·µ »Ø Öµ  : int
 µ÷ÓÃº¯Êı  : 
 ±»µ÷º¯Êı  : 
 
 ĞŞ¸ÄÀúÊ·      :
  1.ÈÕ    ÆÚ   : 2018Äê12ÔÂ24ÈÕ
    ×÷    Õß   : invoker
    ĞŞ¸ÄÄÚÈİ   : ĞÂÉú³Éº¯Êı

*****************************************************************************/
int test (int x)
{
    
}
//ÊäÈëcoÈ»ºóÊäÈëctrl+enter½øĞĞ¿ìËÙ²¹È«µÄÅäÖÃ
//ÔÚº¯ÊıÃûÇ°ÃæÊäÈëfuÈ»ºóctrl+enter¾ÍÄÜÉú³Éº¯ÊıËµÃ÷
/*****************************************************************************
 º¯ Êı Ãû  : sss
 ¹¦ÄÜÃèÊö  : ¢Ëı¾¯Ê
 ÊäÈë²ÎÊı  : int y  
 Êä³ö²ÎÊı  : ÎŞ
 ·µ »Ø Öµ  : int
 µ÷ÓÃº¯Êı  : 
 ±»µ÷º¯Êı  : 
 
 ĞŞ¸ÄÀúÊ·      :
  1.ÈÕ    ÆÚ   : 2018Äê12ÔÂ24ÈÕ
    ×÷    Õß   : invoker
    ĞŞ¸ÄÄÚÈİ   : ĞÂÉú³Éº¯Êı

*****************************************************************************/
int sss(int y)
{
    
}
//Ê¹ÓÃfd ctrl+enter×Ô¶¯Éú³ÉÍ·ÎÄ¼ş

int main()
{
    
}
//ÁíÍâTabSiHostÊÇsource insightµÄÒ»¸ö²å¼ş
/*
ctrl+alt+t ºô³öÖÕ¶Ë
/±íÊ¾¸ùÄ¿Â¼ ./±íÊ¾µ±Ç°Ä¿Â¼
ÀıÈçcd /home/forspy
tab¿ÉÒÔ×Ô¶¯²¹È«
½âÑ¹ÎÄ¼ş:
sudo su ÌáÈ¨ÃüÁî
./³ÌĞò ±íÊ¾Ö´ĞĞ

linuxÏÂ²é¿´ip  sudo apt install net-tools(ĞèÒªÌáÇ°°²×°)
ÊäÈëifconfig²é¿´
¿ÉÒÔping www.baidu.comÊÔÊÔ¿´ ctrl+cÍ£Ö¹ctrl+zÔİÍ£
*/
/*
°²×°SSH·şÎñÆ÷
sudo su
apt-get install ssh

²âÊÔ:
lsof -i:22
sshd    6528 root    3u  IPv4  98733      0t0  TCP *:ssh (LISTEN)
sshd    6528 root    4u  IPv6  98744      0t0  TCP *:ssh (LISTEN)
Ê¹ÓÃwinÏÂÃæµÄxshell putty scrtÁ¬½Ó×Ô¼ºµÄĞéÄâ»ú(ÕâÀïÎÒÑ¡ÓÃµÄÊÇscrt£¬¿ÉÒÔÊ¹ÓÃifconfig»ñµÃ×Ô¼ºĞéÄâ»úµÄipµØÖ·)

//ÔÚscrtÖĞ
sudo su£¨±ØĞëÔÚrootÈ¨ÏŞÏÂ²ÅÄÜÔÚ¸ùÄ¿Â¼ÏÂ´´½¨ÎÄ¼ş¼Ğ
cd /
mkdir work
È»ºóĞŞ¸ÄworkÎÄ¼ş¼ĞµÄÈ¨ÏŞ
chown -R forspy:forspy work/  (ÇĞ»»ÊôÖ÷£¬Ê¹ËûÔÚÆÕÍ¨ÓÃ»§ÏÂÒ²ÄÜÖ´ĞĞ)
È»ºóls -l»á·¢ÏÖÊ¹ÓÃÕßºÍ´´½¨Õß¶¼»áÊÇÆÕÍ¨ÓÃ»§¶ø²»ÊÇroot
(scrtÖĞµÄÖĞÎÄÂÒÂëÔÚÑ¡ÏîÀïÃæ-»á»°Ñ¡Ïî-Íâ¹Û-×Ö·û±àÂëÑ¡ÔñUTF-8)
//Ô¶³Ì²Ù×÷sftp£¬½øĞĞ´«Êä(wind vsftp filezilla)
Ê¹ÓÃfilezilla
ÅäÖÃ:
Ğ­Òé:sftp
Ö÷»ú:ipµØÖ·
¶Ë¿Ú:22

µÇÂ¼ÀàĞÍ:Ñ¯ÎÊÃÜÂë

È»ºóÍÏ¶¯ÎÄ¼ş¾Í¿ÉÒÔ½øĞĞÔ¶³Ì´«ÊäÁË
*/
//Ê¹ÓÃsu ÓÃ»§Ãû  ÇĞ»»»Ø»ù±¾ÓÃ»§
//Ê¹ÓÃuseradd ÓÃ»§Ãû Ìí¼ÓÓÃ»§Ãû
//Ê¹ÓÃpasswd ÃÜÂë ĞŞ¸ÄÃÜÂë
//ls -al ²é¿´ÎÄ¼şÈ¨ÏŞ
//drwxr-xr-x  2 forspy forspy    4096 10ÔÂ 10 14:12  Desktop
//d´ú±íÊÇÎÄ¼ş¼Ğ rwx(¶ÁĞ´Ö´ĞĞ) Èı×éÑ­»· ¶ÔÓ¦root¡¢ÓÃ»§×é¡¢ÆäËûÓÃ»§µÄÈ¨ÏŞ
//-rw-r--r--  1 root   root        74 10ÔÂ 10 15:18  main.c
//´ú±íÊÇÆÕÍ¨ÎÄ¼ş

